Revit 2027 API
NumberSystem.NumberOrientation Property
 The number orientation of number system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TagOrientation NumberOrientation { get; set; }
Public Property NumberOrientation As TagOrientation
	Get
	Set
public:
property TagOrientation NumberOrientation {
	TagOrientation get ();
	void set (TagOrientation value);
}
member NumberOrientation : TagOrientation with get, set
Property Value
TagOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: Orientation AnyModelDirection is not supported -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace